import Image from "next/image";

function AboutPage() {
  return (
    <div className="max-w-4xl mx-auto p-8 mt-[70px]">
      <Image
        width={500}
        height={500}
        src="/den.jpg"
        alt="মুরারিচাঁদ কলেজ রোভার স্কাউট গ্রুপের ডেন"
        className="float-left w-96 aspect-video object-cover rounded-lg mr-6 mb-4 shadow"
      />
      <h1 className="text-3xl font-bold mb-6">
        মুরারিচাঁদ কলেজ রোভার স্কাউট গ্রুপ
      </h1>
      <p className="mb-4">
        পাকিস্তান-ভারত উপমহাদেশের স্কাউট আন্দোলন ১৯১০ সালে গঠিত হয়। ১৯২০ সালে
        বঙ্গ বয় স্কাউট অ্যাসোসিয়েশন স্বীকৃত হয়। প্রাদেশিক স্কাউট সংগঠন গঠনের
        অব্যবহিত পরেই, ১৯২৭ সালের ১২ই ফেব্রুয়ারি, একটি এম. সি. কলেজ রোভার গ্রুপ
        গঠিত হয়। রোভারিং যাত্রা শুরু হয় মাত্র ১৪ জন সদস্য নিয়ে। রোভার গ্রুপটি
        অধ্যাপক পি. সি. সান্যাল এম. এ.-এর নেতৃত্বে গঠিত হয়।
      </p>
      <p className="mb-4">
        মুরারিচাঁদ কলেজ রোভারিং নিবন্ধন হয় ১৯৭৬ সালের ২রা ডিসেম্বর।
      </p>
      <p className="mb-4">রোভার কর্মসূচি আনুষ্ঠানিকভাবে শুরু হয় ১৯৮০ সালে।</p>
      <h2 className="text-2xl font-semibold mb-4">নিবন্ধনের পর</h2>
      <ul className="list-disc list-inside mb-6 space-y-2">
        <li>রোভার স্কাউট গ্রুপের প্রথম সভাপতি ছিলেন অধ্যাপক হাসান ওয়ারিশ।</li>
        <li>রোভার স্কাউট গ্রুপের প্রথম রোভার লিডার ছিলেন আবিদুল ইসলাম।</li>
        <li>
          রোভার স্কাউট গ্রুপের প্রথম সিনিয়র রোভার মেট ছিলেন আলী আজগর খান।
        </li>
        <li>
          রোভার স্কাউট গ্রুপের গার্লস-ইন-রোভার ইউনিটের প্রথম রোভার স্কাউট লিডার
          ছিলেন সাজিয়া আফরিন খান।
        </li>
        <li>
          রোভার স্কাউট গ্রুপের গার্লস-ইন-রোভার ইউনিটের প্রথম সিনিয়র রোভার মেট
          ছিলেন শামিমা ফেরদৌস নিপা।
        </li>
      </ul>
      <h2 className="text-2xl font-semibold mb-4">নিবন্ধন নম্বর</h2>
      <ul className="list-disc list-inside mb-6 space-y-2">
        <li>রোভার স্কাউট গ্রুপের নিবন্ধন নম্বর ১১০/৭৮।</li>
        <li>গার্লস-ইন-রোভার ইউনিটের নিবন্ধন নম্বর ৫৭৭/৭১।</li>
      </ul>
    </div>
  );
}

export default AboutPage;
